{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(11, 11)", 
        "num_filter": "96", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn1_gamma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_beta", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_mean", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn1_moving_sigma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "Custom", 
      "name": "bn1", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "sliced1", 
      "attr": {"num_outputs": "2"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv21_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv21_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv21", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv22_weight", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv22_bias", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv22", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 1, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "conv2", 
      "attr": {"num_args": "2"}, 
      "inputs": [[14, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn2_gamma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_beta", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_moving_mean", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn2_moving_sigma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "Custom", 
      "name": "bn2", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn3_gamma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_beta", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_moving_mean", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn3_moving_sigma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "Custom", 
      "name": "bn3", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "sliced2", 
      "attr": {"num_outputs": "2"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv41_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv41_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv41", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv42_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv42_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv42", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 1, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "conv4", 
      "attr": {"num_args": "2"}, 
      "inputs": [[38, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn4_gamma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_beta", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_moving_mean", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn4_moving_sigma", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": []
    }, 
    {
      "op": "Custom", 
      "name": "bn4", 
      "attr": {"op_type": "custbatchnorm"}, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "sliced3", 
      "attr": {"num_outputs": "2"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv51_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv51_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv51", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv52_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv52_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv52", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 1, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "conv5", 
      "attr": {"num_args": "2"}, 
      "inputs": [[52, 0, 0], [55, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    12, 
    13, 
    15, 
    16, 
    19, 
    20, 
    21, 
    22, 
    26, 
    27, 
    29, 
    30, 
    31, 
    32, 
    36, 
    37, 
    39, 
    40, 
    43, 
    44, 
    45, 
    46, 
    50, 
    51, 
    53, 
    54
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60
  ], 
  "heads": [[56, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 901]}
}